Subroutine/SY_3dHeatLoad/Automated/Sim_OutterField/Jet_rhosimple/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitT
{
    type       limitTemperature;
    min        101;
    max        1000;
    selectionMode all;
}

//limitp
//{
//    type       limitPressure;
//
//    //minFactor  0.1;
//    //maxFactor  2;
//
//    pMin            10000;
//    pMax            2000000;
//}



//************************************************************************** //
